In [108]:
import os
os.getcwd()
os.listdir()
#os.chdir('Hello_World')
url = ''
from env import password, host, user
def get_db_url():
    url = f'mysql+pymysql://{user}:{password}@{host}/employees'
        
print(url)

In [109]:
url

''

# when possible do df.to_csv(name.csv) and have a copy on your machine

In [110]:
import pandas as pd
import numpy as np
np.random.seed(123)

In [111]:
# Create list of values for names column.

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# Randomly generate arrays of scores for each student for each subject.
# Note that all the values need to have the same length here.

math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

In [112]:
# Construct the DataFrame using the above lists and arrays.

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades,
                   'classroom': np.random.choice(['A', 'B'], len(students))})

In [113]:
df.to_csv('students.csv')

In [114]:
df = pd.read_csv('students.csv')

In [115]:
my_var = 'name'

In [116]:
df[my_var]

0       Sally
1        Jane
2       Suzie
3       Billy
4         Ada
5        John
6      Thomas
7       Marie
8      Albert
9     Richard
10      Isaac
11       Alan
Name: name, dtype: object

In [117]:
bools = df.name.str.startswith('A')

In [118]:
bools #creating a mask

0     False
1     False
2     False
3     False
4      True
5     False
6     False
7     False
8      True
9     False
10    False
11     True
Name: name, dtype: bool

In [119]:
df[bools] #called a boolean mask

    Unnamed: 0    name  math  english  reading classroom
4            4     Ada    77       92       98         A
8            8  Albert    92       62       87         A
11          11    Alan    92       62       72         A

# .loc and .iloc

In [120]:
#df.loc[row_index, column_index]

In [121]:
my_list = [3,6,5,6,7,20]

In [122]:
my_list[:3] #colon : means everything before, or after depending on place

[3, 6, 5]

In [123]:
df.loc[:4, 'math':'reading'] #read as up to 4th item, and math to reading

   math  english  reading
0    62       85       80
1    88       79       67
2    94       74       95
3    98       96       88
4    77       92       98

In [124]:
df.loc[bools] #bools made earlier, checking for 'A' names

    Unnamed: 0    name  math  english  reading classroom
4            4     Ada    77       92       98         A
8            8  Albert    92       62       87         A
11          11    Alan    92       62       72         A

In [125]:
df

    Unnamed: 0     name  math  english  reading classroom
0            0    Sally    62       85       80         A
1            1     Jane    88       79       67         B
2            2    Suzie    94       74       95         A
3            3    Billy    98       96       88         B
4            4      Ada    77       92       98         A
5            5     John    79       76       93         B
6            6   Thomas    82       64       81         A
7            7    Marie    93       63       90         A
8            8   Albert    92       62       87         A
9            9  Richard    69       80       94         A
10          10    Isaac    92       99       93         B
11          11     Alan    92       62       72         A

In [126]:
#df.iloc[]  specify an index value and iloc will return the row

In [127]:
#iloc takes intergers and is NOT inclusive (may need to +1)

In [128]:
#df = df.drop(columns=['Unnamed: 0'])

In [129]:
df.iloc[1:4,:1]

   Unnamed: 0
1           1
2           2
3           3

In [130]:
#CAN USE AGGREGATORS

In [131]:
df.reading.agg('min')

67

In [132]:
df['reading'].min()

67

In [133]:
df[['math', 'english']].agg(['max','min','mean'])

           math    english
max   98.000000  99.000000
min   62.000000  62.000000
mean  84.833333  77.666667

In [134]:
df.describe()

       Unnamed: 0       math    english    reading
count   12.000000  12.000000  12.000000  12.000000
mean     5.500000  84.833333  77.666667  86.500000
std      3.605551  11.134168  13.371158   9.643651
min      0.000000  62.000000  62.000000  67.000000
25%      2.750000  78.500000  63.750000  80.750000
50%      5.500000  90.000000  77.500000  89.000000
75%      8.250000  92.250000  86.750000  93.250000
max     11.000000  98.000000  99.000000  98.000000

In [135]:
df.columns

Index(['Unnamed: 0', 'name', 'math', 'english', 'reading', 'classroom'], dtype='object')

In [136]:
df.groupby('classroom').agg(['min','max','mean'])

/var/folders/wt/3cxh0y194wx3qr52k_wthmwc0000gn/T/ipykernel_29371/86539621.py:1: FutureWarning: ['name'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df.groupby('classroom').agg(['min','max','mean'])

          Unnamed: 0            math             english            reading  \
                 min max   mean  min max    mean     min max   mean     min
classroom
A                  0  11  5.875   62  94  82.625      62  92  72.75      72
B                  1  10  4.750   79  98  89.250      76  99  87.50      67


          max    mean
classroom
A          98  87.125
B          93  85.250

In [137]:
df.groupby('classroom').min()

           Unnamed: 0   name  math  english  reading
classroom
A                   0    Ada    62       62       72
B                   1  Billy    79       76       67

# np.where

np.where(condition, this_where_True, this_where_False)

In [138]:
#df.math >= 70

In [139]:
np.where(df.math >= 70, 'passing', 'failing')

array(['failing', 'passing', 'passing', 'passing', 'passing', 'passing',
       'passing', 'passing', 'passing', 'failing', 'passing', 'passing'],
      dtype='<U7')

In [140]:
df['passing_math'] = np.where(df.math >= 70, 'passing', 'failing')

In [141]:
# assign it to a value so it saves/updates the dataframe

In [142]:
df.head

<bound method NDFrame.head of     Unnamed: 0     name  math  english  reading classroom passing_math
0            0    Sally    62       85       80         A      failing
1            1     Jane    88       79       67         B      passing
2            2    Suzie    94       74       95         A      passing
3            3    Billy    98       96       88         B      passing
4            4      Ada    77       92       98         A      passing
5            5     John    79       76       93         B      passing
6            6   Thomas    82       64       81         A      passing
7            7    Marie    93       63       90         A      passing
8            8   Albert    92       62       87         A      passing
9            9  Richard    69       80       94         A      failing
10          10    Isaac    92       99       93         B      passing
11          11     Alan    92       62       72         A      passing>

In [143]:
avg_math_by_class = 0

# .transform
The .transform method can be used to produce a series with the same length of the original dataframe where each value represents the aggregation from the subgroup resulting from the .groupby.

For example, if we wanted to know the average math grade for each classroom and add this data back to our original dataframe:

in these examples we transform instead of aggregating

In [144]:
df.assign(avg_math_by_class=df.groupby('classroom').math.transform('mean'))

,Unnamed: 0,name,math,english,reading,classroom,passing_math,avg_math_by_class
0,0,Sally,62,85,80,A,failing,82.625
1,1,Jane,88,79,67,B,passing,89.250
2,2,Suzie,94,74,95,A,passing,82.625
3,3,Billy,98,96,88,B,passing,89.250
4,4,Ada,77,92,98,A,passing,82.625
5,5,John,79,76,93,B,passing,89.250
6,6,Thomas,82,64,81,A,passing,82.625
7,7,Marie,93,63,90,A,passing,82.625
8,8,Albert,92,62,87,A,passing,82.625
9,9,Richard,69,80,94,A,failing,82.625
10,10,Isaac,92,99,93,B,passing,89.250
11,11,Alan,92,62,72,A,passing,82.625

In [145]:
df.groupby('classroom').reading.describe()

           count    mean        std   min    25%   50%    75%   max
classroom
A            8.0  87.125   8.887190  72.0  80.75  88.5  94.25  98.0
B            4.0  85.250  12.392874  67.0  82.75  90.5  93.00  93.0

In [146]:
df.groupby('classroom').agg(['mean']).math

/var/folders/wt/3cxh0y194wx3qr52k_wthmwc0000gn/T/ipykernel_29371/1825817502.py:1: FutureWarning: ['name', 'passing_math'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df.groupby('classroom').agg(['mean']).math

             mean
classroom
A          82.625
B          89.250

In [151]:
df.groupby(['classroom', 'passing_math']).describe().T #the .T swaps columns/rows: transpose
#transpose can use used on any matrix (table with colums and rows basically)

classroom                 A                     B
passing_math        failing    passing    passing
Unnamed: 0 count   2.000000   6.000000   4.000000
           mean    4.500000   6.333333   4.750000
           std     6.363961   3.141125   3.862210
           min     0.000000   2.000000   1.000000
           25%     2.250000   4.500000   2.500000
           50%     4.500000   6.500000   4.000000
           75%     6.750000   7.750000   6.250000
           max     9.000000  11.000000  10.000000
math       count   2.000000   6.000000   4.000000
           mean   65.500000  88.333333  89.250000
           std     4.949747   7.061633   7.973916
           min    62.000000  77.000000  79.000000
           25%    63.750000  84.500000  85.750000
           50%    65.500000  92.000000  90.000000
           75%    67.250000  92.750000  93.500000
           max    69.000000  94.000000  98.000000
english    count   2.000000   6.000000   4.000000
           mean   82.500000  69.500000  87.500000
           std     3.535534  11.928956  11.676187
           min    80.000000  62.000000  76.000000
           25%    81.250000  62.250000  78.250000
           50%    82.500000  63.500000  87.500000
           75%    83.750000  71.500000  96.750000
           max    85.000000  92.000000  99.000000
reading    count   2.000000   6.000000   4.000000
           mean   87.000000  87.166667  85.250000
           std     9.899495   9.537645  12.392874
           min    80.000000  72.000000  67.000000
           25%    83.500000  82.500000  82.750000
           50%    87.000000  88.500000  90.500000
           75%    90.500000  93.750000  93.000000
           max    94.000000  98.000000  93.000000

In [153]:
condf1 = pd.DataFrame({'col1':[1,5,7], 'col2':[6,3,20]})
condf2 = pd.DataFrame({'col1':[4,3,2], 'col2':[3,7,59]})

In [160]:
pd.concat([condf1, condf2], axis=1, ignore_index=True) #this makes rows

   0   1  2   3
0  1   6  4   3
1  5   3  3   7
2  7  20  2  59

In [161]:
#concat will not inser values into the existing columns, just append
#IGNORE_INDEX=TRUE will allow a new index to be made so no duplicates

In [159]:

pd.concat([condf1, condf2], axis=0, ignore_index=True) #axis 0 makes columns

   col1  col2
0     1     6
1     5     3
2     7    20
3     4     3
4     3     7
5     2    59

# merge

In [163]:
# df.merge default settings for commonly used parameters.

#left_df.merge(right_df, how='inner', on=None,
#    left_on=None, right_on=None, left_index=False, right_index=False, indicator=False)

In [167]:
users = pd.DataFrame({
    'id':[1,2,3,4,5,6],
    'name':['bob', 'sally','joe','adam','ryan', 'mike'],
    'role_id':[1,2,3,3,np.nan,np.nan]
})

In [168]:
users

   id   name  role_id
0   1    bob      1.0
1   2  sally      2.0
2   3    joe      3.0
3   4   adam      3.0
4   5   ryan      NaN
5   6   mike      NaN

In [169]:
roles = pd.DataFrame({
    'id':[1,2,3,4],
    'name':['admin', 'author', 'reviewer', 'commenter']
})

roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

# concat - merging and joining

pd.concat([df1, df2], axis = 0)

In [175]:
#INDICATOR used below shows how merged

In [174]:
users.merge(roles, left_on='role_id', right_on='id', how='outer', indicator=True)

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0   1.0      admin        both
1   2.0  sally      2.0   2.0     author        both
2   3.0    joe      3.0   3.0   reviewer        both
3   4.0   adam      3.0   3.0   reviewer        both
4   5.0   ryan      NaN   NaN        NaN   left_only
5   6.0   mike      NaN   NaN        NaN   left_only
6   NaN    NaN      NaN   4.0  commenter  right_only

SyntaxError: invalid syntax (107831622.py, line 1)